In [127]:
import pandas as pd
import numpy as np

In [128]:
# !pip install pandas

How is it different from numpy ?
The major limitation of numpy is that it can only work with 1 datatype at a time

Most real-world datasets contain a mixture of different datatypes

Like names of places would be string but their population would be int
==> It is difficult to work with data having heterogeneous values using Numpy

___
McKinsey wants to understand the relation between GDP per capita and life expectancy and 
various trends for their clients.
The company has acquired data from multiple surveys in different countries in the past
This contains info of several years about:
country
population size
life expectancy
GDP per Capita
We have to analyse the data and draw inferences meaningful to the company

In [129]:
df = pd.read_csv(r"G:\My Drive\Training\Students_Access\July_2025_Batch - MIT\3.0 Python\mckinsey.csv")

In [130]:
df

          country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [131]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   country     1704 non-null   object
 1   year        1704 non-null   int64
 2   population  1704 non-null   int64
 3   continent   1704 non-null   object
 4   life_exp    1704 non-null   float64
 5   gdp_cap     1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [132]:
df.dtypes

country        object
year            int64
population      int64
continent      object
life_exp      float64
gdp_cap       float64
dtype: object

In [133]:
df.shape

(1704, 6)

In [134]:
df.size

10224

In [135]:
1704*6

10224

In [136]:
df.head(10)

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106
5  Afghanistan  1977    14880372      Asia    38.438  786.113360
6  Afghanistan  1982    12881816      Asia    39.854  978.011439
7  Afghanistan  1987    13867957      Asia    40.822  852.395945
8  Afghanistan  1992    16317921      Asia    41.674  649.341395
9  Afghanistan  1997    22227415      Asia    41.763  635.341351

In [137]:
df.tail(10)

       country  year  population continent  life_exp     gdp_cap
1694  Zimbabwe  1962     4277736    Africa    52.358  527.272182
1695  Zimbabwe  1967     4995432    Africa    53.995  569.795071
1696  Zimbabwe  1972     5861135    Africa    55.635  799.362176
1697  Zimbabwe  1977     6642107    Africa    57.674  685.587682
1698  Zimbabwe  1982     7636524    Africa    60.363  788.855041
1699  Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700  Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701  Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702  Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703  Zimbabwe  2007    12311143    Africa    43.487  469.709298

In [138]:
df.describe()

             year    population     life_exp        gdp_cap
count  1704.00000  1.704000e+03  1704.000000    1704.000000
mean   1979.50000  2.960121e+07    59.474439    7215.327081
std      17.26533  1.061579e+08    12.917107    9857.454543
min    1952.00000  6.001100e+04    23.599000     241.165876
25%    1965.75000  2.793664e+06    48.198000    1202.060309
50%    1979.50000  7.023596e+06    60.712500    3531.846988
75%    1993.25000  1.958522e+07    70.845500    9325.462346
max    2007.00000  1.318683e+09    82.603000  113523.132900

In [139]:
df.describe(include = "object")

            country continent
count          1704      1704
unique          142         5
top     Afghanistan    Africa
freq             12       624

In [140]:
df1 = pd.DataFrame([
    ["India",1995],
    ["India",1997],
    ["India",1999]
],columns = ["Country","Year"])

In [141]:
df1

  Country  Year
0   India  1995
1   India  1997
2   India  1999

In [142]:
df2 = pd.DataFrame({
    "Country":["India","India","India"],
    "Year":[1995,1997,1999]
})

In [143]:
df2

  Country  Year
0   India  1995
1   India  1997
2   India  1999

In [144]:
df[["country","year"]]

          country  year
0     Afghanistan  1952
1     Afghanistan  1957
2     Afghanistan  1962
3     Afghanistan  1967
4     Afghanistan  1972
...           ...   ...
1699     Zimbabwe  1987
1700     Zimbabwe  1992
1701     Zimbabwe  1997
1702     Zimbabwe  2002
1703     Zimbabwe  2007

[1704 rows x 2 columns]

In [145]:
df.iloc[0:2,0:2]

       country  year
0  Afghanistan  1952
1  Afghanistan  1957

In [146]:
df.loc[[0,2,3],["country","population","continent"]]

       country  population continent
0  Afghanistan     8425333      Asia
2  Afghanistan    10267083      Asia
3  Afghanistan    11537966      Asia

In [147]:
df.iloc[[0,2,3],[0,2,3]]

       country  population continent
0  Afghanistan     8425333      Asia
2  Afghanistan    10267083      Asia
3  Afghanistan    11537966      Asia

In [148]:
df.tail()

       country  year  population continent  life_exp     gdp_cap
1699  Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700  Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701  Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702  Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703  Zimbabwe  2007    12311143    Africa    43.487  469.709298

In [149]:
df.loc[1703,"population"] = 11215961551

In [150]:
df.tail()

       country  year   population continent  life_exp     gdp_cap
1699  Zimbabwe  1987      9216418    Africa    62.351  706.157306
1700  Zimbabwe  1992     10704340    Africa    60.377  693.420786
1701  Zimbabwe  1997     11404948    Africa    46.809  792.449960
1702  Zimbabwe  2002     11926563    Africa    39.989  672.038623
1703  Zimbabwe  2007  11215961551    Africa    43.487  469.709298

In [151]:
df.loc[[1703]] = ["ZIMBA",2008,154165,np.nan,50,500]

In [152]:
df.tail()

       country  year  population continent  life_exp     gdp_cap
1699  Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700  Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701  Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702  Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     ZIMBA  2008      154165       NaN    50.000  500.000000

In [153]:
df["continent"].unique()

array(['Asia', 'Europe', 'Africa', 'Americas', 'Oceania', nan],
      dtype=object)

In [154]:
df["continent"].value_counts()

continent
Africa      623
Asia        396
Europe      360
Americas    300
Oceania      24
Name: count, dtype: int64

In [155]:
df["continent"].nunique()

5

In [156]:
df.head()

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [157]:
df.rename({"population":"POP"},axis = 1,inplace = True)

In [158]:
df

          country  year       POP continent  life_exp     gdp_cap
0     Afghanistan  1952   8425333      Asia    28.801  779.445314
1     Afghanistan  1957   9240934      Asia    30.332  820.853030
2     Afghanistan  1962  10267083      Asia    31.997  853.100710
3     Afghanistan  1967  11537966      Asia    34.020  836.197138
4     Afghanistan  1972  13079460      Asia    36.088  739.981106
...           ...   ...       ...       ...       ...         ...
1699     Zimbabwe  1987   9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992  10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997  11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002  11926563    Africa    39.989  672.038623
1703        ZIMBA  2008    154165       NaN    50.000  500.000000

[1704 rows x 6 columns]

In [159]:
df.drop([1703],inplace = True)

In [160]:
df

          country  year       POP continent  life_exp     gdp_cap
0     Afghanistan  1952   8425333      Asia    28.801  779.445314
1     Afghanistan  1957   9240934      Asia    30.332  820.853030
2     Afghanistan  1962  10267083      Asia    31.997  853.100710
3     Afghanistan  1967  11537966      Asia    34.020  836.197138
4     Afghanistan  1972  13079460      Asia    36.088  739.981106
...           ...   ...       ...       ...       ...         ...
1698     Zimbabwe  1982   7636524    Africa    60.363  788.855041
1699     Zimbabwe  1987   9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992  10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997  11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002  11926563    Africa    39.989  672.038623

[1703 rows x 6 columns]

In [161]:
# df.drop(["POP"],axis = 1,inplace = True)

In [162]:
df["POP"] = (df["POP"]/1000000).round(2)

In [163]:
df["add_2_years"] = df["year"] + 2

In [164]:
df

          country  year    POP continent  life_exp     gdp_cap  add_2_years
0     Afghanistan  1952   8.43      Asia    28.801  779.445314         1954
1     Afghanistan  1957   9.24      Asia    30.332  820.853030         1959
2     Afghanistan  1962  10.27      Asia    31.997  853.100710         1964
3     Afghanistan  1967  11.54      Asia    34.020  836.197138         1969
4     Afghanistan  1972  13.08      Asia    36.088  739.981106         1974
...           ...   ...    ...       ...       ...         ...          ...
1698     Zimbabwe  1982   7.64    Africa    60.363  788.855041         1984
1699     Zimbabwe  1987   9.22    Africa    62.351  706.157306         1989
1700     Zimbabwe  1992  10.70    Africa    60.377  693.420786         1994
1701     Zimbabwe  1997  11.40    Africa    46.809  792.449960         1999
1702     Zimbabwe  2002  11.93    Africa    39.989  672.038623         2004

[1703 rows x 7 columns]

In [165]:
df.columns = ['Country', 'Year', 'Population', 'Continent', 'Life_exp', 'Gdp_cap',
       'Add_2_years']

In [166]:
df

,Country,Year,Population,Continent,Life_exp,Gdp_cap,Add_2_years
0,Afghanistan,1952,8.43,Asia,28.801,779.445314,1954
1,Afghanistan,1957,9.24,Asia,30.332,820.853030,1959
2,Afghanistan,1962,10.27,Asia,31.997,853.100710,1964
3,Afghanistan,1967,11.54,Asia,34.020,836.197138,1969
4,Afghanistan,1972,13.08,Asia,36.088,739.981106,1974
...,...,...,...,...,...,...,...
1698,Zimbabwe,1982,7.64,Africa,60.363,788.855041,1984
1699,Zimbabwe,1987,9.22,Africa,62.351,706.157306,1989
1700,Zimbabwe,1992,10.70,Africa,60.377,693.420786,1994
1701,Zimbabwe,1997,11.40,Africa,46.809,792.449960,1999
1702,Zimbabwe,2002,11.93,Africa,39.989,672.038623,2004

In [167]:
df.index = [i for i in range(1001,2704)]

In [168]:
df

,Country,Year,Population,Continent,Life_exp,Gdp_cap,Add_2_years
1001,Afghanistan,1952,8.43,Asia,28.801,779.445314,1954
1002,Afghanistan,1957,9.24,Asia,30.332,820.853030,1959
1003,Afghanistan,1962,10.27,Asia,31.997,853.100710,1964
1004,Afghanistan,1967,11.54,Asia,34.020,836.197138,1969
1005,Afghanistan,1972,13.08,Asia,36.088,739.981106,1974
...,...,...,...,...,...,...,...
2699,Zimbabwe,1982,7.64,Africa,60.363,788.855041,1984
2700,Zimbabwe,1987,9.22,Africa,62.351,706.157306,1989
2701,Zimbabwe,1992,10.70,Africa,60.377,693.420786,1994
2702,Zimbabwe,1997,11.40,Africa,46.809,792.449960,1999
2703,Zimbabwe,2002,11.93,Africa,39.989,672.038623,2004

In [169]:
df.reset_index(inplace = True, drop = True)

In [170]:
df.sort_values(["Year","Country"],ascending = [False,True])

,Country,Year,Population,Continent,Life_exp,Gdp_cap,Add_2_years
11,Afghanistan,2007,31.89,Asia,43.828,974.580338,2009
23,Albania,2007,3.60,Europe,76.423,5937.029526,2009
35,Algeria,2007,33.33,Africa,72.301,6223.367465,2009
47,Angola,2007,12.42,Africa,42.731,4797.231267,2009
59,Argentina,2007,40.30,Americas,75.320,12779.379640,2009
...,...,...,...,...,...,...,...
1644,Vietnam,1952,26.25,Asia,40.412,605.066492,1954
1656,West Bank and Gaza,1952,1.03,Asia,43.160,1515.592329,1954
1668,"Yemen, Rep.",1952,4.96,Asia,32.548,781.717576,1954
1680,Zambia,1952,2.67,Africa,42.038,1147.388831,1954
1692,Zimbabwe,1952,3.08,Africa,48.451,406.884115,1954

In [171]:
df

,Country,Year,Population,Continent,Life_exp,Gdp_cap,Add_2_years
0,Afghanistan,1952,8.43,Asia,28.801,779.445314,1954
1,Afghanistan,1957,9.24,Asia,30.332,820.853030,1959
2,Afghanistan,1962,10.27,Asia,31.997,853.100710,1964
3,Afghanistan,1967,11.54,Asia,34.020,836.197138,1969
4,Afghanistan,1972,13.08,Asia,36.088,739.981106,1974
...,...,...,...,...,...,...,...
1698,Zimbabwe,1982,7.64,Africa,60.363,788.855041,1984
1699,Zimbabwe,1987,9.22,Africa,62.351,706.157306,1989
1700,Zimbabwe,1992,10.70,Africa,60.377,693.420786,1994
1701,Zimbabwe,1997,11.40,Africa,46.809,792.449960,1999
1702,Zimbabwe,2002,11.93,Africa,39.989,672.038623,2004

In [172]:
df.loc[len(df)] = ["ZIMBA",2008,15.15,"Africa",50.5,500.6,2010]

In [173]:
df.tail(20)

       Country  Year  Population Continent  Life_exp      Gdp_cap  Add_2_years
1684    Zambia  1972        4.51    Africa    50.107  1773.498265         1974
1685    Zambia  1977        5.22    Africa    51.386  1588.688299         1979
1686    Zambia  1982        6.10    Africa    51.821  1408.678565         1984
1687    Zambia  1987        7.27    Africa    50.821  1213.315116         1989
1688    Zambia  1992        8.38    Africa    46.100  1210.884633         1994
1689    Zambia  1997        9.42    Africa    40.238  1071.353818         1999
1690    Zambia  2002       10.60    Africa    39.193  1071.613938         2004
1691    Zambia  2007       11.75    Africa    42.384  1271.211593         2009
1692  Zimbabwe  1952        3.08    Africa    48.451   406.884115         1954
1693  Zimbabwe  1957        3.65    Africa    50.469   518.764268         1959
1694  Zimbabwe  1962        4.28    Africa    52.358   527.272182         1964
1695  Zimbabwe  1967        5.00    Africa    53.995   569.795071         1969
1696  Zimbabwe  1972        5.86    Africa    55.635   799.362176         1974
1697  Zimbabwe  1977        6.64    Africa    57.674   685.587682         1979
1698  Zimbabwe  1982        7.64    Africa    60.363   788.855041         1984
1699  Zimbabwe  1987        9.22    Africa    62.351   706.157306         1989
1700  Zimbabwe  1992       10.70    Africa    60.377   693.420786         1994
1701  Zimbabwe  1997       11.40    Africa    46.809   792.449960         1999
1702  Zimbabwe  2002       11.93    Africa    39.989   672.038623         2004
1703     ZIMBA  2008       15.15    Africa    50.500   500.600000         2010

In [174]:
df.duplicated().sum()

0

In [175]:
df.drop_duplicates(inplace = True)

In [176]:
df.tail()

       Country  Year  Population Continent  Life_exp     Gdp_cap  Add_2_years
1699  Zimbabwe  1987        9.22    Africa    62.351  706.157306         1989
1700  Zimbabwe  1992       10.70    Africa    60.377  693.420786         1994
1701  Zimbabwe  1997       11.40    Africa    46.809  792.449960         1999
1702  Zimbabwe  2002       11.93    Africa    39.989  672.038623         2004
1703     ZIMBA  2008       15.15    Africa    50.500  500.600000         2010

In [177]:
df.duplicated().sum()

0

In [178]:
df[(df["Country"] == "India") & (df["Life_exp"]>50) & (df["Year"]> 2000)]

    Country  Year  Population Continent  Life_exp      Gdp_cap  Add_2_years
706   India  2002     1034.17      Asia    62.879  1746.769454         2004
707   India  2007     1110.40      Asia    64.698  2452.210407         2009

In [179]:
df[df.duplicated()]

Empty DataFrame
Columns: [Country, Year, Population, Continent, Life_exp, Gdp_cap, Add_2_years]
Index: []

In [180]:
df

,Country,Year,Population,Continent,Life_exp,Gdp_cap,Add_2_years
0,Afghanistan,1952,8.43,Asia,28.801,779.445314,1954
1,Afghanistan,1957,9.24,Asia,30.332,820.853030,1959
2,Afghanistan,1962,10.27,Asia,31.997,853.100710,1964
3,Afghanistan,1967,11.54,Asia,34.020,836.197138,1969
4,Afghanistan,1972,13.08,Asia,36.088,739.981106,1974
...,...,...,...,...,...,...,...
1699,Zimbabwe,1987,9.22,Africa,62.351,706.157306,1989
1700,Zimbabwe,1992,10.70,Africa,60.377,693.420786,1994
1701,Zimbabwe,1997,11.40,Africa,46.809,792.449960,1999
1702,Zimbabwe,2002,11.93,Africa,39.989,672.038623,2004
1703,ZIMBA,2008,15.15,Africa,50.500,500.600000,2010

In [181]:
'''
SELECT COUNTRY,avg(LIFE_EXP)
FROM DF
GROUP BY continent,COUNTRY
'''

'\nSELECT COUNTRY,avg(LIFE_EXP)\nFROM DF\nGROUP BY continent,COUNTRY\n'

In [182]:
df["Country"].value_counts()

Country
Afghanistan    12
Pakistan       12
New Zealand    12
Nicaragua      12
Niger          12
               ..
Ghana          12
Greece         12
Guatemala      12
Zimbabwe       11
ZIMBA           1
Name: count, Length: 143, dtype: int64

In [183]:
df_country_wise = df.groupby("Country")[["Life_exp"]].mean()

In [184]:
df_country_wise

                     Life_exp
Country
Afghanistan         37.478833
Albania             68.432917
Algeria             59.030167
Angola              37.883500
Argentina           69.060417
...                       ...
West Bank and Gaza  60.328667
Yemen, Rep.         46.780417
ZIMBA               50.500000
Zambia              45.996333
Zimbabwe            53.497364

[143 rows x 1 columns]

In [185]:
df_continent_wise = df.groupby(["Continent","Country"])[["Life_exp"]].mean()

In [186]:
df_continent_wise

                           Life_exp
Continent Country
Africa    Algeria         59.030167
          Angola          37.883500
          Benin           48.779917
          Botswana        54.597500
          Burkina Faso    44.694000
...                             ...
Europe    Switzerland     75.565083
          Turkey          59.696417
          United Kingdom  73.922583
Oceania   Australia       74.662917
          New Zealand     73.989500

[143 rows x 1 columns]

In [187]:
# joins

In [188]:
users = pd.DataFrame({
    "user_id":[1,2,3],
    "name":["Rishu","Rohini","Ashwin"]
})

In [189]:
msgs = pd.DataFrame({
    "user_id":[1,2,2,4],
    "message":["Ok","Bye","Yes","Fine"]
})

In [190]:
users

   user_id    name
0        1   Rishu
1        2  Rohini
2        3  Ashwin

In [191]:
msgs

   user_id message
0        1      Ok
1        2     Bye
2        2     Yes
3        4    Fine

In [192]:
msgs.merge(users,how = "outer",left_on = "user_id",right_on = "user_id")

   user_id message    name
0        1      Ok   Rishu
1        2     Bye  Rohini
2        2     Yes  Rohini
3        3     NaN  Ashwin
4        4    Fine     NaN

In [193]:
pd.concat([users,msgs],axis = 0)

   user_id    name message
0        1   Rishu     NaN
1        2  Rohini     NaN
2        3  Ashwin     NaN
0        1     NaN      Ok
1        2     NaN     Bye
2        2     NaN     Yes
3        4     NaN    Fine

In [194]:
df1

  Country  Year
0   India  1995
1   India  1997
2   India  1999

In [195]:
df2

  Country  Year
0   India  1995
1   India  1997
2   India  1999

In [196]:
df3 = pd.DataFrame({
    "Full_Name":[" Alice Smith ","bob-jones","carol white","DAVID-MILLER","  Eve stone"],
    "birth_date":pd.to_datetime(["1998-04-12","2001-11-23","1995-11-23","1999-01-30","2000-03-15"])
})

In [197]:
df3

       Full_Name birth_date
0   Alice Smith  1998-04-12
1      bob-jones 2001-11-23
2    carol white 1995-11-23
3   DAVID-MILLER 1999-01-30
4      Eve stone 2000-03-15

In [198]:
df3["Full_Name"] = df3["Full_Name"].str.strip()
df3["Full_Name"] = df3["Full_Name"].str.replace("-"," ")
df3["Full_Name"] = df3["Full_Name"].str.title()

In [199]:
df3["First_Name"] = df3["Full_Name"].str.split().str[0]
df3["Last_Name"] = df3["Full_Name"].str.split().str[1]

In [200]:
df3["year"] = df3["birth_date"].dt.year
df3["month"] = df3["birth_date"].dt.month
df3["day"] = df3["birth_date"].dt.day
df3["day_name"] = df3["birth_date"].dt.day_name()

In [201]:
df3["age"] = 2025 - df3["year"]

In [202]:
df3["Customer_Seg"] = np.where(df3["year"] >= 1997,"Genz","Millenial")

In [203]:
df3

,Full_Name,birth_date,First_Name,Last_Name,year,month,day,day_name,age,Customer_Seg
0,Alice Smith,1998-04-12,Alice,Smith,1998,4,12,Sunday,27,Genz
1,Bob Jones,2001-11-23,Bob,Jones,2001,11,23,Friday,24,Genz
2,Carol White,1995-11-23,Carol,White,1995,11,23,Thursday,30,Millenial
3,David Miller,1999-01-30,David,Miller,1999,1,30,Saturday,26,Genz
4,Eve Stone,2000-03-15,Eve,Stone,2000,3,15,Wednesday,25,Genz

In [204]:
df4 = pd.DataFrame({
    "dateTIME":pd.to_datetime(["2025-05-15 08:30:55","2025-05-14 09:31:59","2025-05-12 18:10:35"])
})

In [205]:
df4["date_part"] = df4["dateTIME"].dt.date
df4["time_part"] = df4["dateTIME"].dt.time
df4["hour_part"] = df4["dateTIME"].dt.hour
df4["minute_part"] = df4["dateTIME"].dt.minute
df4["second_part"] = df4["dateTIME"].dt.second

In [206]:
df4

,dateTIME,date_part,time_part,hour_part,minute_part,second_part
0,2025-05-15 08:30:55,2025-05-15,08:30:55,8,30,55
1,2025-05-14 09:31:59,2025-05-14,09:31:59,9,31,59
2,2025-05-12 18:10:35,2025-05-12,18:10:35,18,10,35

In [207]:
df4["add_7_days"]  = df4["dateTIME"] + pd.Timedelta(days = 7)
df4["add_7_hours"]  = df4["dateTIME"] + pd.Timedelta(hours = 7)

In [208]:
df4

,dateTIME,date_part,time_part,hour_part,minute_part,second_part,add_7_days,add_7_hours
0,2025-05-15 08:30:55,2025-05-15,08:30:55,8,30,55,2025-05-22 08:30:55,2025-05-15 15:30:55
1,2025-05-14 09:31:59,2025-05-14,09:31:59,9,31,59,2025-05-21 09:31:59,2025-05-14 16:31:59
2,2025-05-12 18:10:35,2025-05-12,18:10:35,18,10,35,2025-05-19 18:10:35,2025-05-13 01:10:35

In [209]:
df4["date_diff"] = df4["add_7_days"] - df4["dateTIME"]

In [210]:
df4

,dateTIME,date_part,time_part,hour_part,minute_part,second_part,add_7_days,add_7_hours,date_diff
0,2025-05-15 08:30:55,2025-05-15,08:30:55,8,30,55,2025-05-22 08:30:55,2025-05-15 15:30:55,7 days
1,2025-05-14 09:31:59,2025-05-14,09:31:59,9,31,59,2025-05-21 09:31:59,2025-05-14 16:31:59,7 days
2,2025-05-12 18:10:35,2025-05-12,18:10:35,18,10,35,2025-05-19 18:10:35,2025-05-13 01:10:35,7 days

In [211]:
df.describe()

              Year   Population     Life_exp        Gdp_cap  Add_2_years
count  1704.000000  1704.000000  1704.000000    1704.000000  1704.000000
mean   1979.500587    29.602923    59.478555    7215.345210  1981.500587
std      17.266282   106.157717    12.913127    9857.442158    17.266282
min    1952.000000     0.060000    23.599000     241.165876  1954.000000
25%    1965.750000     2.790000    48.236500    1202.060309  1967.750000
50%    1979.500000     7.025000    60.712500    3531.846988  1981.500000
75%    1993.250000    19.587500    70.845500    9325.462346  1995.250000
max    2008.000000  1318.680000    82.603000  113523.132900  2010.000000

In [212]:
import matplotlib.pyplot as plt
import seaborn as sns